In [1]:
import numpy as np
import pandas as pd
%matplotlib inline

In [2]:
df = pd.read_csv("data/weather_mini.csv")

In [3]:
df.head()

   MONTH  DAY  TIME  TEMP  PRESSURE
0      1    1     1   6.8     10207
1      1    1     2   5.8     10214
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225
4      1    1     5   4.5     10230

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   MONTH     10 non-null     int64
 1   DAY       10 non-null     int64
 2   TIME      10 non-null     int64
 3   TEMP      10 non-null     float64
 4   PRESSURE  10 non-null     int64
dtypes: float64(1), int64(4)
memory usage: 528.0 bytes

In [5]:
df['TEMP']

0    6.8
1    5.8
2    5.7
3    6.0
4    4.5
5    2.0
6    1.1
7    0.7
8    0.2
9    2.0
Name: TEMP, dtype: float64

In [6]:
df['TEMP'][1]

5.8

In [7]:
dft = df.T

In [8]:
dft.tail()

,0,1,2,3,4,5,6,7,8,9
MONTH,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
DAY,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
TIME,1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0,10.0
TEMP,6.8,5.8,5.7,6.0,4.5,2.0,1.1,0.7,0.2,2.0
PRESSURE,10207.0,10214.0,10220.0,10225.0,10230.0,10237.0,10242.0,10245.0,10248.0,10249.0

In [9]:
dft.columns

RangeIndex(start=0, stop=10, step=1)

In [10]:
dft[2]

MONTH           1.0
DAY             1.0
TIME            3.0
TEMP            5.7
PRESSURE    10220.0
Name: 2, dtype: float64

In [11]:
dft[2]['TIME']

3.0

In [12]:
dft[2][2]

3.0

In [13]:
test = pd.DataFrame([['John'],['Bob'],['Anne']], index=[4,3,4])

In [14]:
test

      0
4  John
3   Bob
4  Anne

In [15]:
 test[0][4]

4    John
4    Anne
Name: 0, dtype: object

# Idexing with Lists and Slices

In [16]:
df.head()

   MONTH  DAY  TIME  TEMP  PRESSURE
0      1    1     1   6.8     10207
1      1    1     2   5.8     10214
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225
4      1    1     5   4.5     10230

In [17]:
df[['PRESSURE', 'TEMP', 'TIME']]

   PRESSURE  TEMP  TIME
0     10207   6.8     1
1     10214   5.8     2
2     10220   5.7     3
3     10225   6.0     4
4     10230   4.5     5
5     10237   2.0     6
6     10242   1.1     7
7     10245   0.7     8
8     10248   0.2     9
9     10249   2.0    10

In [18]:
df['TEMP'][[3,1,4]]

3    6.0
1    5.8
4    4.5
Name: TEMP, dtype: float64

In [19]:
# slicing is for rows only
df[['TEMP','TIME']][2:4]

   TEMP  TIME
2   5.7     3
3   6.0     4

In [20]:
df[2:4][['PRESSURE', 'TEMP']]

   PRESSURE  TEMP
2     10220   5.7
3     10225   6.0

In [21]:
dft

,0,1,2,3,4,5,6,7,8,9
MONTH,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
DAY,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
TIME,1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0,10.0
TEMP,6.8,5.8,5.7,6.0,4.5,2.0,1.1,0.7,0.2,2.0
PRESSURE,10207.0,10214.0,10220.0,10225.0,10230.0,10237.0,10242.0,10245.0,10248.0,10249.0

In [22]:
dft[2:4][[3,4]]

        3    4
TIME  4.0  5.0
TEMP  6.0  4.5

In [23]:
df

   MONTH  DAY  TIME  TEMP  PRESSURE
0      1    1     1   6.8     10207
1      1    1     2   5.8     10214
2      1    1     3   5.7     10220
3      1    1     4   6.0     10225
4      1    1     5   4.5     10230
5      1    1     6   2.0     10237
6      1    1     7   1.1     10242
7      1    1     8   0.7     10245
8      1    1     9   0.2     10248
9      1    1    10   2.0     10249

In [24]:
df['PRESSURE']

0    10207
1    10214
2    10220
3    10225
4    10230
5    10237
6    10242
7    10245
8    10248
9    10249
Name: PRESSURE, dtype: int64

In [25]:
df['PRESSURE'][1:3]

1    10214
2    10220
Name: PRESSURE, dtype: int64

In [26]:
dft

,0,1,2,3,4,5,6,7,8,9
MONTH,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
DAY,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
TIME,1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0,10.0
TEMP,6.8,5.8,5.7,6.0,4.5,2.0,1.1,0.7,0.2,2.0
PRESSURE,10207.0,10214.0,10220.0,10225.0,10230.0,10237.0,10242.0,10245.0,10248.0,10249.0

In [27]:
dft[1:4]

        0    1    2    3    4    5    6    7    8     9
DAY   1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0  1.0   1.0
TIME  1.0  2.0  3.0  4.0  5.0  6.0  7.0  8.0  9.0  10.0
TEMP  6.8  5.8  5.7  6.0  4.5  2.0  1.1  0.7  0.2   2.0

In [28]:
dft['TIME':'PRESSURE']

,0,1,2,3,4,5,6,7,8,9
TIME,1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0,10.0
TEMP,6.8,5.8,5.7,6.0,4.5,2.0,1.1,0.7,0.2,2.0
PRESSURE,10207.0,10214.0,10220.0,10225.0,10230.0,10237.0,10242.0,10245.0,10248.0,10249.0

## using loc and iloc
- loc : row based 
- iloc : index based

In [29]:
capitals = pd.DataFrame(
    [
        ["Ngerulmud", 391, 1.87],
        ['Vatican City', 826, 100],
        ['Yaren', 1100, 10.91],
        ['Funafuti', 4492, 45.48],
        ['City of San Marino', 4493]
    ],
    index=["Palau", "Vatican City", "Nauru", "Tuvalu", "San Mario"],
    columns = ["Capital", "Population", 'Percentage']
)

In [31]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Mario     City of San Marino        4493         NaN

In [32]:
capitals.loc["Nauru"]

Capital       Yaren
Population     1100
Percentage    10.91
Name: Nauru, dtype: object

In [33]:
capitals.loc["Nauru", "Population"] #loc is faster than chain indexing

1100

In [34]:
capitals['Population']["Nauru"] #chain indexing

1100

In [35]:
capitals.loc["Palau":"Nauru", ["Population", "Percentage"]]

              Population  Percentage
Palau                391        1.87
Vatican City         826      100.00
Nauru               1100       10.91

In [36]:
capitals.loc["Vatican City", ["Population"]]

Population    826
Name: Vatican City, dtype: object

In [37]:
capitals.loc["Vatican City", "Population"]

826

In [38]:
capitals.loc[["Vatican City", "Nauru"]]

                   Capital  Population  Percentage
Vatican City  Vatican City         826      100.00
Nauru                Yaren        1100       10.91

In [42]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Mario     City of San Marino        4493         NaN

In [43]:
capitals.iloc[[1,4]]

                         Capital  Population  Percentage
Vatican City        Vatican City         826       100.0
San Mario     City of San Marino        4493         NaN

In [44]:
capitals.iloc[[1,4], 1:]

              Population  Percentage
Vatican City         826       100.0
San Mario           4493         NaN

In [45]:
capitals.iloc[:4, 1]

Palau            391
Vatican City     826
Nauru           1100
Tuvalu          4492
Name: Population, dtype: int64

## Filtering with Boolean Expressions

In [46]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Mario     City of San Marino        4493         NaN

In [47]:
capitals[["Capital", "Population"]]

                         Capital  Population
Palau                  Ngerulmud         391
Vatican City        Vatican City         826
Nauru                      Yaren        1100
Tuvalu                  Funafuti        4492
San Mario     City of San Marino        4493

In [48]:
capitals["Percentage"] > 25

Palau           False
Vatican City     True
Nauru           False
Tuvalu           True
San Mario       False
Name: Percentage, dtype: bool

In [49]:
capitals[capitals["Percentage"] > 25]

                   Capital  Population  Percentage
Vatican City  Vatican City         826      100.00
Tuvalu            Funafuti        4492       45.48

In [50]:
grades = pd.DataFrame(
    [[6,4], [7,8], [6,7], [6,5], [5,2]],
    index = ["Mary", "John", "Ann", "Pete", "Laura"], 
    columns = ["test1", "test2"]
)

In [51]:
grades

       test1  test2
Mary       6      4
John       7      8
Ann        6      7
Pete       6      5
Laura      5      2

In [52]:
# students who didn't improve after 1st test
grades[grades["test1"] >= grades["test2"]]

       test1  test2
Mary       6      4
Pete       6      5
Laura      5      2

In [53]:
# students who perform greather than mean score
grades.mean() > 5.5

test1     True
test2    False
dtype: bool

In [54]:
grades.loc[:, grades.mean() > 5.5]

       test1
Mary       6
John       7
Ann        6
Pete       6
Laura      5

## Assigning Values

In [55]:
grades

       test1  test2
Mary       6      4
John       7      8
Ann        6      7
Pete       6      5
Laura      5      2

In [56]:
grades.loc[["John", "Laura"], "test2"] += 2

In [57]:
grades

       test1  test2
Mary       6      4
John       7     10
Ann        6      7
Pete       6      5
Laura      5      4

In [58]:
grades['test1'] += 0.5

In [59]:
grades

       test1  test2
Mary     6.5      4
John     7.5     10
Ann      6.5      7
Pete     6.5      5
Laura    5.5      4

In [60]:
grades.loc["Mary"] += 2
grades

       test1  test2
Mary     8.5    6.0
John     7.5   10.0
Ann      6.5    7.0
Pete     6.5    5.0
Laura    5.5    4.0

In [61]:
grades.loc["Pete"] = [7,8]

In [62]:
grades

       test1  test2
Mary     8.5    6.0
John     7.5   10.0
Ann      6.5    7.0
Pete     7.0    8.0
Laura    5.5    4.0

In [63]:
failing = grades < 6
passing = grades >= 6
grades[failing] = "Fail"
grades[passing] = "Pass"
grades

      test1 test2
Mary   Pass  Pass
John   Pass  Pass
Ann    Pass  Pass
Pete   Pass  Pass
Laura  Fail  Fail

------

In [64]:
grades = pd.DataFrame(
    [[6,4], [7,8], [6,7], [6,5], [5,2]],
    index = ["Mary", "John", "Ann", "Pete", "Laura"], 
    columns = ["test1", "test2"]
)

In [69]:
grades

       test1  test2
Mary       6      4
John       7      8
Ann        6      7
Pete       6      5
Laura      5      2

In [70]:
grades.mean() # default by columns

test1    6.0
test2    5.2
dtype: float64

In [71]:
grades.mean(axis=1) #by rows

Mary     5.0
John     7.5
Ann      6.5
Pete     5.5
Laura    3.5
dtype: float64

In [73]:
grades.mean(axis=1) > 6

Mary     False
John      True
Ann       True
Pete     False
Laura    False
dtype: bool

In [74]:
# add new column
grades["passed"] = grades.mean(axis=1) > 6
grades

       test1  test2  passed
Mary       6      4   False
John       7      8    True
Ann        6      7    True
Pete       6      5   False
Laura      5      2   False

## Sorting

In [77]:
capitals.sort_index()

                         Capital  Population  Percentage
Nauru                      Yaren        1100       10.91
Palau                  Ngerulmud         391        1.87
San Mario     City of San Marino        4493         NaN
Tuvalu                  Funafuti        4492       45.48
Vatican City        Vatican City         826      100.00

In [78]:
capitals

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Mario     City of San Marino        4493         NaN

In [79]:
capitals.sort_index(inplace=True)

In [80]:
capitals

                         Capital  Population  Percentage
Nauru                      Yaren        1100       10.91
Palau                  Ngerulmud         391        1.87
San Mario     City of San Marino        4493         NaN
Tuvalu                  Funafuti        4492       45.48
Vatican City        Vatican City         826      100.00

In [84]:
capitals.sort_index(axis=1,ascending=False)
capitals

                         Capital  Population  Percentage
Vatican City        Vatican City         826      100.00
Tuvalu                  Funafuti        4492       45.48
San Mario     City of San Marino        4493         NaN
Palau                  Ngerulmud         391        1.87
Nauru                      Yaren        1100       10.91

In [85]:
capitals.sort_values(by=["Population"])

                         Capital  Population  Percentage
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91
Tuvalu                  Funafuti        4492       45.48
San Mario     City of San Marino        4493         NaN

In [88]:
capitals.sort_values(by=["Capital", "Population"])

                         Capital  Population  Percentage
San Mario     City of San Marino        4493         NaN
Tuvalu                  Funafuti        4492       45.48
Palau                  Ngerulmud         391        1.87
Vatican City        Vatican City         826      100.00
Nauru                      Yaren        1100       10.91